In [ ]:
with open('./drive/Mydrive/ReadME,md','w') as f:
  data = f.write = f.write('**반가워')

In [ ]:
!pwd

# 넘파이(numpy)

- ndim : 축의 개수
- shape : 배열의 차원정보
- size : 배열 안에 있는 원소의 총 개수
- dtype : 배열 원소의 자료형

In [ ]:
#pip install numpy
import numpy as np
narry = np.array(range(5))
print(narry)
print(narry.ndim)
print(narry.shape)
print(narry.size)
print(narry[3])
print(narry[2:4]) # <= x <

In [ ]:
narr1 = np.array([1,2,3,4])
narr2 = np.array([1,2,'a','b']) # 숫자와 문자가 함께 들어가면 모두 str 처리를 해버린다,
narr3 = np.array([1,2,'a','b'], dtype = 'str')
print(narr1,narr1.dtype)
print(narr2,narr2.dtype)
print(narr3,narr3.dtype)

In [ ]:
narr4 = np.zeros((2,2),dtype = 'int64')
narr5 = np.ones((2,2))
narr6 = np.full((3,3),3)
narr7 = np.full((3,3),'number')
narr8 =  np.eye(3)
narr9 = np.linspace(0,100,5, endpoint=False, dtype='int64')
narr10 = np.arange(0,100,20)
print(narr4, narr4.ndim, narr4.dtype, narr4.shape, narr4.size, type(narr4))
print(narr5, narr5.ndim, narr5.dtype, narr5.shape, narr5.size, type(narr5))
print(narr6, narr6.ndim, narr6.dtype, narr6.shape, narr6.size, type(narr6))
print(narr7, narr7.ndim, narr7.dtype, narr7.shape, narr7.size, type(narr7))
print(narr8, narr8.ndim, narr8.dtype, narr8.shape, narr8.size, type(narr8))
print(narr9, narr9.ndim, narr9.dtype, narr9.shape, narr9.size, type(narr9))
print(narr10, narr10.ndim, narr10.dtype, narr10.shape, narr10.size, type(narr10))

In [ ]:
arr1 = np.array([[0,0],[0,0]])
print(arr1, arr1.ndim, arr1.dtype, arr1, arr1.size, type(arr1))

# 2차원 배열

In [ ]:
print(list(range(2,10)))
print(np.arange(2,10))
range(10)
np.arange(20)

In [ ]:
arr2 = np.array([[1,2,3,4,5,6,7,8,9]])
print(arr2, arr2.ndim, arr2.dtype, arr2, arr2.size, type(arr2))

In [ ]:
arr2 = np.array([1,2,3,4,5,6,7,8,9]).reshape(3,3)
arr3 = np.arange(1,10).reshape(3,3)
arr4 = np.arange(1,11).reshape(2,5)
arr5 = np.arange(1,11).reshape(5,2)
arr6 = np.arange(1,28).reshape(3,3,3)
print('차원:',arr2.ndim,'/ 데이터타입:', arr2.dtype,'/형태:', arr2.shape, '/크기:', arr2.size, type(arr2),arr2)
print('차원:',arr3.ndim,'/ 데이터타입:', arr3.dtype,'/형태:', arr3.shape, '/크기:', arr3.size, type(arr3),arr3)
print('차원:',arr4.ndim,'/ 데이터타입:', arr4.dtype,'/형태:', arr4.shape, '/크기:', arr4.size, type(arr4),arr4)
print('차원:',arr5.ndim,'/ 데이터타입:', arr5.dtype,'/형태:', arr5.shape, '/크기:', arr5.size, type(arr5),arr5)
print('차원:',arr6.ndim,'/ 데이터타입:', arr6.dtype,'/형태:', arr6.shape, '/크기:', arr6.size, type(arr6),arr6)

In [ ]:
arr3 = np.arange(1,22).reshape(3,7)
arr4 = np.arange(1,8).reshape(7,1)
arr5 = np.arange(1,11).reshape(5,2)
arr6 = np.arange(1,13).reshape(3,4,1)

print(arr3)
print('='*30)
print(arr4)
print('='*30)
print(arr5)
print('='*30)
print(arr3)
print('='*30)
print(arr6)
print(arr3[1:3,2:4])
print(arr3[1:3,2:5])
print(arr3[arr3 > 12])
print(arr3 % 2 == 0)

In [ ]:
# np 배열 연산 // shape가 같을 경우 원소별 연산이 가능
np1 = np.array([1,2,3,4,5])
np2 = np.array([6,7,8,9,10])
print("덧셈:",np1 + np2)
print("뺄셈:",np1 - np2)
print("곱셈:",np1 * np2)
print("나눗셈:",np1 / np2)

In [ ]:
# 브로드캐스팅
np3 = np1 + 10
print(np3)

In [ ]:
br1 = np.arange(1,10).reshape(3,3)
br2 = np.array([11,22,33])
print(br1)
print(br2)
# 스칼라와 연산
print("==============")
print(br1+3)
print(br1*3)
# 2D와 1D의 연산
print("==============")
print(br1+br2)
print(br1*br2)

In [ ]:
ff = np.arange(1,10).reshape(3,3)
print(ff)
print(ff)
print(ff.flatten())

In [ ]:
from google import genai

client = genai.Client(api_key="AIzaSyB_eerncLSXPC1eSYf2sEoKNlF03s35szA")
response = client.models.generate_content(
    model="gemini-2.0-flash", contents="Explain how AI works"
)
print(response.text)

In [ ]:
!pip install google

## Random number 발생

- np.random.randint(): 균일 분포의 정수 난수
- np.random.rand(): 0부터 1사이의 균일 분포 난수 생성
- np.random.randn(): 표준 정규 분포 난수 생성
- np.random.normal(): 정규 분포 난수 생성

In [ ]:
# randomint
import numpy as np
x = np.random.randint(1,100,size=(3,3,3))
x

In [ ]:
print('평균값: ', np.mean(x),'표준편차:',np.std(x),'최소값:',x.min(),'최대값:',x.max())

In [ ]:
print(len(x.flatten()))

In [ ]:
import numpy as np
y = np.array([1,10,2,3,4,12,3,5,0,3,4,5,6,4,5,4,50,2,3,2,3,2,3,2,3,2,3]).reshape(3,3,3)
print(len(y.flatten()))
print(np.count_nonzero(y))

# 판다스(pandas)

- 시리즈(series)
- 데이터프레임(dataframe)

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# 판다스 기초
data1 = np.arange(1,6)
print(data1)
data2 = pd.Series(data1)
print(data2,type(data2),data2.index,data2.values, data2.dtype)

In [ ]:
dir(data2)

In [ ]:
# 판다스 시리즈의 데이터타입
data3 = pd.Series([1,2,3.14,4,5,6,7]) #dtype="float") # 자료에 하나라도 float 타입이 있다면 전체 타입이 통일된다.
print(data3)

In [ ]:
# 판다스 시리즈의 인덱스 설정
data3 = pd.Series([1,2,3,4],index=['a','b','c','d'])
print(data3)

In [ ]:
# 판다스 시리즈 딕셔너리데이터
population_dict = {
    'korea':5182,
    'japan':12622,
    'china':141178,
    'usa':32976
}
#population_dict.keys()
#population_dict.values()
#population_dict.items()
country = pd.Series(population_dict)
print(country,country.index, country.values) #괄호는 기능을 담고있다. 
print(country.ndim, country.shape, country.size)
print(country.loc['korea'])
print(country.iloc[3])

In [ ]:
# 판다스 데이터 프렝림
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index=['a','b','c'], columns=['A','B','C'])
print(df)

In [165]:
# 테스트
import numpy as np
import pandas as pd

# 두 개의 시리즈 데이터
print("인구수 시리즈 데이터")
population_dict = {
    'korea':5182,
    'japan':12622,
    'china':141178,
    'usa':32976
}
population = pd.Series(population_dict)
print(population)
print("GDP 시리즈 데이터")
GDP_dict = {
    'korea':169320000,
    'japan':516700000,
    'china':140925000,
    'usa':2041180000
}
GDP = pd.Series(GDP_dict)
print(GDP)
print('='*25)
print("데이터프레임생성")
country = pd.DataFrame({'populatio':population,'gdp':GDP})
country.index.name = "Conutry" # 인덱스 이름을 지정
country.columns.name = "Info" # 컬럼 이름 지정
print(country.index, country.columns)
print(country.values, country.shape, country.size, country.ndim)

인구수 시리즈 데이터
korea      5182
japan     12622
china    141178
usa       32976
dtype: int64
GDP 시리즈 데이터
korea     169320000
japan     516700000
china     140925000
usa      2041180000
dtype: int64
=========================
데이터프레임생성
Index(['korea', 'japan', 'china', 'usa'], dtype='object', name='Conutry') Index(['populatio', 'gdp'], dtype='object', name='Info')
[[      5182  169320000]
 [     12622  516700000]
 [    141178  140925000]
 [     32976 2041180000]] (4, 2) 8 2

In [ ]:
country.loc['korea':'japan',:'population']

In [154]:
# 데이터 프레임의 요소 접근 방법, loc, iloc
country.loc['korea'],country.loc['usa']
country.iloc[2],country.iloc[1]
country

Info     populatio           gdp       gdp_per
Conutry
korea       5182.0  1.693200e+08  32674.642995
japan      12622.0  5.167000e+08  40936.460149
china     141178.0  1.409250e+08    998.207936
usa        32976.0  2.041180e+09  61898.956817
india      14222.0  1.505050e+09    851.646815

In [155]:
country.iloc[0:2,:1]

Info     populatio
Conutry
korea       5182.0
japan      12622.0

In [156]:
# 컬럼추가
#country['test']=[11,22,33,44]
#country.drop('test',axis=1)
gdpper = country['gdp']/country['populatio']
country['gdp_per'] = gdpper
country

Info     populatio           gdp        gdp_per
Conutry
korea       5182.0  1.693200e+08   32674.642995
japan      12622.0  5.167000e+08   40936.460149
china     141178.0  1.409250e+08     998.207936
usa        32976.0  2.041180e+09   61898.956817
india      14222.0  1.505050e+09  105825.481648

In [157]:
country.iloc[1:4:, 1]

Conutry
japan    5.167000e+08
china    1.409250e+08
usa      2.041180e+09
Name: gdp, dtype: float64

In [158]:
country.iloc[1:3,:2]

Info     populatio          gdp
Conutry
japan      12622.0  516700000.0
china     141178.0  140925000.0

In [159]:
# 행추가
country.loc['india'] = [14222,1505050000,12112121]
country.loc['india','gdp_per'] = country.loc['india','gdp_per']/country.loc['india','populatio']
country

Info     populatio           gdp       gdp_per
Conutry
korea       5182.0  1.693200e+08  32674.642995
japan      12622.0  5.167000e+08  40936.460149
china     141178.0  1.409250e+08    998.207936
usa        32976.0  2.041180e+09  61898.956817
india      14222.0  1.505050e+09    851.646815

In [160]:
# 행추가 방법2
africa = pd.Series(data=[123456,7777777], index=['population','gdp'])
country.loc['africa']= africa
country

Info     populatio           gdp       gdp_per
Conutry
korea       5182.0  1.693200e+08  32674.642995
japan      12622.0  5.167000e+08  40936.460149
china     141178.0  1.409250e+08    998.207936
usa        32976.0  2.041180e+09  61898.956817
india      14222.0  1.505050e+09    851.646815
africa         NaN  7.777777e+06           NaN

In [161]:
# 결과값 확인
country.isnull()#.sum()

Info     populatio    gdp  gdp_per
Conutry
korea        False  False    False
japan        False  False    False
china        False  False    False
usa          False  False    False
india        False  False    False
africa        True  False     True

In [162]:
# 열제거 drop(이름, axis=0)
country = country.drop('africa', axis=0)
country

Info     populatio           gdp       gdp_per
Conutry
korea       5182.0  1.693200e+08  32674.642995
japan      12622.0  5.167000e+08  40936.460149
china     141178.0  1.409250e+08    998.207936
usa        32976.0  2.041180e+09  61898.956817
india      14222.0  1.505050e+09    851.646815

In [163]:
# 테스트1 조건
country[country['populatio'] > 14000]

Info     populatio           gdp       gdp_per
Conutry
china     141178.0  1.409250e+08    998.207936
usa        32976.0  2.041180e+09  61898.956817
india      14222.0  1.505050e+09    851.646815

In [ ]:
# 테스트 2 조건, 슬라이싱(loc)
country[(country['populatio'] > 14000) & (country[country['populatio']] < 100000)]:['popullation']

In [13]:
import numpy as np
import pandas as pd

score_kor = {
    '홍길동':80,
    '박철수':60,
    '김영희':70
}
scoreK = pd.Series(score_kor)
#print(scoreK)
score_math = {
    '홍길동':70,
    '박철수':70,
    '김영희':90
}
scoreM = pd.Series(score_math)
#print(scoreM)
score_eng = {
    '홍길동':80,
    '박철수':80,
    '김영희':80
}
scoreE = pd.Series(score_eng)
#print(scoreE)

scoreData = pd.DataFrame({'국어':scoreK,'수학':scoreM,'영어':scoreE})
scoreData.index.name = ""
scoreData.columns.name = "이름"

scoreData

이름   국어  수학  영어

홍길동  80  70  80
박철수  60  70  80
김영희  70  90  80

In [16]:
scoreData.iloc[1:2:,0:2]

이름   국어  수학

박철수  60  70

In [18]:
scoreData[scoreData['수학']>=70]

이름   국어  수학  영어

홍길동  80  70  80
박철수  60  70  80
김영희  70  90  80

In [26]:
avg = (scoreData['국어'] + scoreData['수학'] + scoreData['영어']) / 3
scoreData['평균'] = avg
scoreData

이름     국어    수학    영어         평균

홍길동  80.0  70.0  80.0  76.666667
박철수  60.0  70.0  80.0  70.000000
김영희  70.0  90.0  80.0  80.000000
박자바  55.0  95.0  70.0  73.333333

In [28]:
박자바 = pd.Series(data = [55,95,70], index=['국어','수학','영어'])
scoreData.loc['박자바'] = 박자바
avg = (scoreData['국어'] + scoreData['수학'] + scoreData['영어']) / 3
scoreData['평균'] = avg
scoreData

이름     국어    수학    영어         평균

홍길동  80.0  70.0  80.0  76.666667
박철수  60.0  70.0  80.0  70.000000
김영희  70.0  90.0  80.0  80.000000
박자바  55.0  95.0  70.0  73.333333

### 풀이

In [167]:
# 기본적인 방법
data = {
    '이름':['홍길동','박철수','김영희'],
    '국어':[80,60,70],
    '수학':[70,70,70],
    '영어':[80,80,80]
}

df = pd.DataFrame(data)
df

    이름  국어  수학  영어
0  홍길동  80  70  80
1  박철수  60  70  80
2  김영희  70  70  80

In [168]:
# 키값쌍으로 리스트에 저장하는 방법
data = [
    {'이름':'홍길동','국어':80,'수학':70, '영어':80},
    {'이름':'박철수','국어':60,'수학':70, '영어':80},
    {'이름':'김영희','국어':70,'수학':70, '영어':80}]
df = pd.DataFrame(data)
df

    이름  국어  수학  영어
0  홍길동  80  70  80
1  박철수  60  70  80
2  김영희  70  70  80

In [180]:
# 리스트에 튜플로 저장하는 방법 / 속도 빠름
data = [
    ('홍길동',80,70,80),
    ('박철수',60,70,80),
    ('김영희',70,70,80),
]
    
df = pd.DataFrame(data, columns=['이름','국어','수학','영어'])
df

    이름  국어  수학  영어
0  홍길동  80  70  80
1  박철수  60  70  80
2  김영희  70  70  80

In [179]:
#import numpy as np 
#data0 = [
#    ('홍길동',80,70,80),
#    ('박철수',60,70,80),
#    ('김영희',70,70,80),
#]

# data = np.array(data)
#data = np.array([['홍길동',80,70,80],['박철수',60,70,80],['김영희',70,70,80]])
#data

In [181]:
df

    이름  국어  수학  영어
0  홍길동  80  70  80
1  박철수  60  70  80
2  김영희  70  70  80

In [185]:
df.loc[1:1]
df.iloc[1:2]

    이름  국어  수학  영어
1  박철수  60  70  80

In [194]:
# 국어가 70점 넘는 학생 출력
df[df['국어']>=70]

    이름  국어  수학  영어         평균
0  홍길동  80  70  80  76.666667
2  김영희  70  70  80  73.333333

In [ ]:
# 평균
import numpy as np
import pandas as pd

df['평균']=(df['국어']+ df['수학']+ df['영어'])/3
print('평균',df['평균'].dtype)
df.round().dtype()

df.loc[3] = ('최자바',55,95,70)
df